tap "1password/tap"
tap "buo/cask-upgrade"
tap "epk/epk"
tap "esolitos/ipa"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "teamookla/speedtest"
brew "act"
brew "jpeg-xl"
brew "openssl@3"
brew "protobuf"
brew "grpc"
brew "thrift"
brew "apache-arrow"
brew "coreutils"
brew "asdf"
brew "openssl@1.1"
brew "python@3.11"
brew "autojump"
brew "python@3.10"
brew "azure-cli"
brew "bat"
brew "fontconfig"
brew "glib"
brew "pycparser"
brew "cffi"
brew "cmake"
brew "libssh2"
brew "openldap"
brew "dbmate"
brew "direnv"
brew "libgit2"
brew "pygit2"
brew "python-cryptography"
brew "dvc"
brew "erlang"
brew "elixir"
brew "exercism"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "harfbuzz"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "flyctl"
brew "freerdp"
brew "freetds"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gnupg"
brew "krb5"
brew "libpq", link: true
brew "nss"
brew "gdal"
brew "gh"
brew "git"
brew "git-flow"
brew "git-standup"
brew "glances"
brew "go"
brew "gobject-introspection"
brew "grpc@1.54"
brew "htop"
brew "jq"
brew "jsonnet-bundler"
brew "lazygit"
brew "mas"
brew "mkcert"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "node"
brew "openconnect"
brew "php"
brew "postgis"
brew "postgresql@15"
brew "tcl-tk"
brew "python@3.8"
brew "python@3.9"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "rust"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "subversion"
brew "tldr"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-history-substring-search"
brew "esolitos/ipa/sshpass"
brew "jesseduffield/lazydocker/lazydocker"
brew "teamookla/speedtest/speedtest"
cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "alt-tab"
cask "appcleaner"
cask "arc"
cask "calibre"
cask "crystalfetch"
cask "daisydisk"
cask "dash"
cask "dbeaver-community"
cask "discord"
cask "docker"
cask "dropbox"
cask "figma"
cask "firefox-developer-edition"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-sf-mono-nerd-font"
cask "google-chrome"
cask "kitty"
cask "logi-options-plus"
cask "maccy"
cask "miniconda"
cask "monitorcontrol"
cask "notion"
cask "opera"
cask "paw"
cask "raindropio"
cask "rapidapi"
cask "rectangle"
cask "shortcat"
cask "slack"
cask "spotify"
cask "sublime-merge"
cask "tailscale"
cask "teamviewer"
cask "the-unarchiver"
cask "todoist"
cask "tor-browser"
cask "transmission"
cask "transmit"
cask "utm"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Silicio", id: 933627574
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
vscode "be5invis.toml"
vscode "bradlc.vscode-tailwindcss"
vscode "Catppuccin.catppuccin-vsc"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "circledev.glsl-canvas"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "Digimezzo.jetbrains-rider-new-ui-theme"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.remotehub"
vscode "Grafana.vscode-jsonnet"
vscode "GregorBiswanger.json2ts"
vscode "Gruntfuggly.todo-tree"
vscode "infeng.vscode-react-typescript"
vscode "JakeBecker.elixir-ls"
vscode "jojoee.conda-cheatsheet"
vscode "lextudio.restructuredtext"
vscode "loiane.ts-extension-pack"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "msaraiva.surface"
vscode "NarasimaPandiyan.jetbrainsmono"
vscode "njpwerner.autodocstring"
vscode "NuclleaR.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "phoenixframework.phoenix"
vscode "pmneo.tsimporter"
vscode "Qvist.jetbrains-new-ui-dark-theme"
vscode "rbbit.typescript-hero"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "samuel-pordeus.elixir-test"
vscode "sapegin.Theme-SquirrelsongLight"
vscode "saratravi.elixir-formatter"
vscode "statelyai.stately-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "styled-components.vscode-styled-components"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
vscode "zeshuaro.vscode-python-poetry"
vscode "ZixuanChen.vitest-explorer"
