tap "1password/tap"
tap "epk/epk"
tap "esolitos/ipa"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "teamookla/speedtest"
brew "jpeg-xl"
brew "coreutils"
brew "asdf"
brew "python@3.10"
brew "autojump"
brew "bat"
brew "fontconfig"
brew "glib"
brew "python@3.9"
brew "libssh2"
brew "openldap"
brew "curl"
brew "dbmate"
brew "dvc"
brew "erlang"
brew "elixir"
brew "exa"
brew "exercism"
brew "p11-kit"
brew "gnutls"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "freerdp"
brew "fswatch"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-flow"
brew "glances"
brew "gnupg"
brew "gobject-introspection"
brew "htop"
brew "jq"
brew "lazygit"
brew "mkcert"
brew "neovim"
brew "nghttp2"
brew "nginx"
brew "node"
brew "nss"
brew "openconnect"
brew "php"
brew "python@3.8"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "ssh-copy-id"
brew "stow"
brew "subversion"
brew "tldr"
brew "tmux"
brew "tree"
brew "yarn"
brew "youtube-dl"
brew "zsh-history-substring-search"
brew "esolitos/ipa/sshpass"
brew "teamookla/speedtest/speedtest"
cask "1password-cli"
cask "alacritty"
cask "font-sf-mono-nerd-font"
cask "kitty"
cask "maccy"
cask "wezterm"
vscode "be5invis.toml"
vscode "ChakrounAnas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "circledev.glsl-canvas"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "GitHub.copilot"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "GregorBiswanger.json2ts"
vscode "Gruntfuggly.todo-tree"
vscode "Hyzeta.vscode-theme-github-light"
vscode "infeng.vscode-react-typescript"
vscode "JakeBecker.elixir-ls"
vscode "josecfreittas.livebook"
vscode "loiane.ts-extension-pack"
vscode "lokalise.i18n-ally"
vscode "marp-team.marp-vscode"
vscode "mikestead.dotenv"
vscode "mjmcloug.vscode-elixir"
vscode "mrmlnc.vscode-json5"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-typescript-next"
vscode "NuclleaR.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-jest"
vscode "phoenixframework.phoenix"
vscode "pmneo.tsimporter"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "saratravi.elixir-formatter"
vscode "statelyai.stately-vscode"
vscode "stringham.move-ts"
vscode "styled-components.vscode-styled-components"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wix.vscode-import-cost"
