tap "anomalyco/tap"
tap "azure/azd", trusted: true
tap "epk/epk", trusted: true
tap "teamookla/speedtest", trusted: true
# Run your GitHub Actions locally
brew "act"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Next generation open source RPC library and framework
brew "grpc"
# Next-gen compiler infrastructure
brew "llvm"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Core application library for C
brew "glib"
# Shell extension to jump to frequently used directories
brew "autojump"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Toolchain of the web
brew "biome"
# Python code formatter
brew "black"
# Collection of portable C++ source libraries
brew "boost"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Cross-platform make
brew "cmake"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# Zsh completion for conda
brew "conda-zsh-completion"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Lightweight, framework-agnostic database migration tool
brew "dbmate"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# GNU compiler collection
brew "gcc"
# Package for scientific computing with Python
brew "numpy"
# Bindings to the libgit2 shared library
brew "pygit2"
# Git for data science projects
brew "dvc"
# TIFF library and utilities
brew "libtiff"
# Programming language for highly scalable real-time systems
brew "erlang"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Command-line tool to interact with exercism.io
brew "exercism"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg@4"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line tools for fly.io services
brew "flyctl"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# New file format for still image compression
brew "jpeg-xl"
# Library for encoding and decoding .avif files
brew "libavif"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Git extension to generate reports for standup meetings
brew "git-standup"
# Alternative to top/htop
brew "glances"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library access to GnuPG
brew "gpgme"
# File format designed to store large amounts of data
brew "hdf5"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Interactive computing in Python
brew "ipython"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Package manager for Jsonnet
brew "jsonnet-bundler"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interactive environments for writing and running code
brew "jupyterlab"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Postgres C API library
brew "libpq", link: true
# Mac App Store command-line interface
brew "mas"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Remote terminal application
brew "mosh"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# Visual browser for netCDF format files
brew "ncview"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# HTTP/2 C Library
brew "nghttp2"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# User-level SOCKS and port forwarding proxy
brew "ocproxy"
# Open client for Cisco AnyConnect VPN
brew "openconnect"
# Development kit for the Java programming language
brew "openjdk"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# General-purpose scripting language
brew "php"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package management made easy
brew "pixi"
# Tool for managing OCI containers and pods
brew "podman"
# Alternative to docker-compose using podman
brew "podman-compose"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Hook preloader
brew "proxychains-ng"
# Implementation of Telnet and SSH
brew "putty"
# Python version management
brew "pyenv"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Version control system designed to be a better CVS
brew "subversion"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Manage complex tmux sessions easily
brew "tmuxinator"
# Lightweight BitTorrent client
brew "transmission-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Bring your favorite shell wherever you go through the ssh
brew "xxh"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Azure Developer CLI
brew "azure/azd/azd"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Application uninstaller
cask "appcleaner"
# Backup and restore SD cards, USB drives, external HDD, etc
cask "applepi-baker"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# E-books management software
cask "calibre"
# Brings the power of Copilot coding agent directly to your terminal
cask "copilot-cli"
# Write, edit, and chat about your code with AI
cask "cursor"
# Disk space visualiser
cask "daisydisk"
# API documentation browser and code snippet manager
cask "dash"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Universal database tool and SQL client
cask "dbeaver-community"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# Web browser
cask "firefox@nightly"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "epk/epk/font-sf-mono-nerd-font"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Software for Logitech devices
cask "logi-options+"
# Adaptive brightness for external displays
cask "lunar"
# Clipboard manager
cask "maccy"
# Minimal installer for conda
cask "miniconda"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# AI coding agent desktop client
cask "opencode-desktop"
# Web browser
cask "opera"
# Browse, manage, inspect containers and images
cask "podman-desktop"
# Translation editor
cask "poedit"
# Collaboration platform for API development
cask "postman"
# VPN client
cask "privadovpn"
# IDE for professional Python development
cask "pycharm"
# Geographic Information System
cask "qgis"
# All-in-one bookmark manager
cask "raindropio"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# 3D modeling software used to create and manipulate 3D models
cask "sketchup"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Remote access and connectivity software focused on security
cask "teamviewer"
# Unpacks archive files
cask "the-unarchiver"
# To-do list
cask "todoist-app"
# Web browser focusing on security
cask "tor-browser"
# Open-source BitTorrent client
cask "transmission"
# File transfer application
cask "transmit"
# Virtualizer for x86 and arm64 hardware
cask "virtualbox-beta"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Bear", id: 1091189122
mas "Connective Plugin", id: 1428740565
mas "F5Access", id: 1243219105
mas "GarageBand", id: 682658836
mas "keymapp", id: 6472865291
mas "Keynote", id: 361285480
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Kindle Classic", id: 405399194
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Notability", id: 360593530
mas "NotePlan", id: 1505432629
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 361309726
mas "Pages", id: 409201541
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 6746662575
mas "Silicio", id: 933627574
mas "TaskForge", id: 6744716215
mas "Web eID", id: 1576665083
mas "Windows App", id: 1295203466
mas "WireGuard", id: 1451685025
vscode "alefragnani.bookmarks"
vscode "alefragnani.project-manager"
vscode "be5invis.toml"
vscode "be5invis.vscode-custom-css"
vscode "biomejs.biome"
vscode "buenon.scratchpads"
vscode "chadalen.vscode-jetbrains-icon-theme"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "docker.docker"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "foam.foam-vscode"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "gruntfuggly.todo-tree"
vscode "huytd.nord-light"
vscode "infeng.vscode-react-typescript"
vscode "jakebecker.elixir-ls"
vscode "kevinrose.vsc-python-indent"
vscode "lextudio.restructuredtext"
vscode "loiane.ts-extension-pack"
vscode "maarti.jenkins-doc"
vscode "marp-team.marp-vscode"
vscode "mateocerquetella.xcode-12-theme"
vscode "mikestead.dotenv"
vscode "mrmlnc.vscode-json5"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-ossdata.vscode-pgsql"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.js-debug-nightly"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "msaraiva.surface"
vscode "narasimapandiyan.jetbrainsmono"
vscode "naren.solarized-n"
vscode "njqdev.vscode-python-typehint"
vscode "nucllear.vscode-extension-auto-import"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "orta.vscode-jest"
vscode "philipbe.theme-gray-matter"
vscode "qvist.jetbrains-new-ui-dark-theme"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tht13.rst-vscode"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
vscode "wholroyd.jinja"
vscode "wix.vscode-import-cost"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zeshuaro.vscode-python-poetry"
cargo "bat"
cargo "cargo-binstall"
cargo "cargo-expand"
cargo "cargo-license"
cargo "cargo-vcpkg"
cargo "create-tauri-app"
cargo "du-dust"
cargo "eza"
cargo "fd-find"
cargo "gitui"
cargo "just"
cargo "launchdeck"
cargo "lsd"
cargo "ripgrep"
cargo "sd"
cargo "serie"
cargo "skim"
cargo "turm"
cargo "zapp"
npm "@openai/codex"
npm "@pnp/cli-microsoft365"
npm "opencode-ai"
